app/Controllers/komik.php

    public function updateKomik($id){

        $slug = url_title($this->request->getVar('judul'), '-', true);
        $this->komikModel->save([
            'id' => $id,
            'judul' => $this->request->getVar('judul'),
            'slug' => $slug,
            'penulis' => $this->request->getVar('penulis'),
            'penerbit' => $this->request->getVar('penerbit'),
            'sampul' => $this->request->getVar('sampul'),
        ]);
---
UPDATE `komik` SET `judul` = 'Nigga', `slug` = 'nigga', `penulis` = '', `penerbit` = 'Orang Tua Reza', `sampul` = 'lego2.jpg', `update_at` = '2023-11-26 08:40:14'
WHERE `komik`.`id` IN ('21')